---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.RPCTurnOffInRealisticWarn
source: html/b8ee7636-7fc4-9b17-388b-658730cc8dab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.RPCTurnOffInRealisticWarn Property

None of the placed RPC elements are visible when the visual style is set to Realistic. To see the elements, change VisualStyle of the current view, or change RPC visibility in Graphic Display Options.

## Syntax (C#)
```csharp
public static FailureDefinitionId RPCTurnOffInRealisticWarn { get; }
```